Repository: open-data/goodtables
Catalog: goodtables/i18n/*/LC_MESSAGES/goodtables.po
Languages: fr

source: Dataset inspection has reached {} table(s) limit
fr: L'inspection du jeu de données a atteint la limite de {} table(s)

source: Table "{}" inspection has reached {} row(s) limit
fr: L'inspection de la table "{}" a atteint la limite de {} ligne(s)

source: Table "{}" inspection has reached {} error(s) limit
fr: L'inspection de la table "{}" a atteint la limite d'erreur(s) de {}

source: IO Error
fr: Erreur d'entrée ou de sortie

source: The data source returned an IO Error of type {error_type}
fr: La source de données a généré une erreur d'entrée ou de sortie de type {error_type}

source: Data reading error because of IO error. How it could be resolved: - Fix path if it's not correct.
fr: Lecture des données erronée causée par l'erreur d'entrée ou de sortie. Solution: - Corriger le chemin d'accès.

source: HTTP Error
fr: Erreur HTTP

source: The data source returned an HTTP error with a status code of {status_code}
fr: La source de données a généré une erreur HTTP avec le code d'état {status_code}

source: Data reading error because of HTTP error. How it could be resolved: - Fix url link if it's not correct.
fr: Lecture des données erronée causée par l'erreur HTTP. Solution : - Corriger le lien URL.

source: Source Error
fr: Erreur de la source

source: The data source has not supported or has inconsistent contents; no tabular data can be extracted
fr: La source de données n'a pas pris en charge le contenuou celui-ci est incohérent; aucune donnée tabulaire ne peut être extraite

source: Data reading error because of not supported or inconsistent contents. How it could be resolved: - Fix data contents (e.g. change JSON data to array or arrays/objects). - Set correct source settings in {validator}.
fr: Lecture des données erronée causée par le contenu qui n'est pas pris en charge ou incohérent. Solution : - Corriger le contenu des données (p. ex. modifier les données JSON en tableau ou en tableaux/objets). - Configurer correctement les paramètres de la source dans {validator}.

source: Scheme Error
fr: Erreur de schéma

source: The data source is in an unknown scheme; no tabular data can be extracted
fr: Le schéma de la source de données est inconnu; aucune donnée tabulaire ne peut être extraite.

source: Data reading error because of incorrect scheme. How it could be resolved: - Fix data scheme (e.g. change scheme from `ftp` to `http`). - Set correct scheme in {validator}.
fr: Lecture des données erronée causée par un schéma incorrect. Solution : - Corriger le schéma de données (p. ex. modifier le schéma de `ftp` à `http`). - Configurer correctement les schémas dans {validator}.

source: Format Error
fr: Erreur de format

source: The data source is in an unknown format; no tabular data can be extracted
fr: Le format de la source de données est inconnu; aucune donnée tabulaire ne peut être extraite

source: Data reading error because of incorrect format. How it could be resolved: - Fix data format (e.g. change file extension from `txt` to `csv`). - Set correct format in {validator}.
fr: Lecture des données erronée causée par un format incorrect. Solution : - Corriger le format des données (p. ex. modifier l'extension du fichier de `txt` à `csv`). - Configurer correctement le format dans {validator}.

source: Encoding Error
fr: Erreur d'encodage

source: The data source could not be successfully decoded with {encoding} encoding
fr: La source des données n'a pas pu être décodée avec l'encodage {encoding}

source: Data reading error because of an encoding problem. How it could be resolved: - Fix data source if it's broken. - Set correct encoding in {validator}.
fr: Lecture des données erronée causée par un problème d'encodage. Solution : - Corriger la source des données. - Configurer correctement l'encodage dans {validator}.

source: Blank Header
fr: En-tête vide

source: Header in column {column_number} is blank
fr: L'en-tête de la colonne {column_number} est vide.

source: A column in the header row is missing a value. Column names should be provided. How it could be resolved: - Add the missing column name to the first row of the data source. - If the first row starts with, or ends with a comma, remove it. - If this error should be ignored disable `blank-header` check in {validator}.
fr: Il manque une valeur dans une colonne de la ligne d'en-tête. Les noms des colonnes doivent être fournis. Solution : - Ajouter le nom manquant de la colonne dans la première ligne dans la source de données. - Si la ligne débute ou se termine par une virgule, elle doit être supprimée. - Si l'erreur doit être ignorée, il faut désactiver la vérification `blank-header` dans le {validator}.

source: Duplicate Header
fr: En-tête en double

source: Header in column {column_number} is duplicated to header in column(s) {column_numbers}
fr: L'en-tête de la colonne {column_number} est dupliquédans l'en-tête de la colonne ou des colonnes {column_numbers}.

source: Two columns in the header row have the same value. Column names should be unique. How it could be resolved: - Add the missing column name to the first row of the data. - If the first row starts with, or ends with a comma, remove it. - If this error should be ignored disable `duplicate-header` check in {validator}.
fr: Deux colonnes de la ligne d'en-tête ont la même valeur. Le nom des colonnes doit être unique. Solution : - Ajouter le nom manquant de la colonne à la première ligne de données. - Si la ligne commence ou se termine par une virgule, elle doit être supprimée. -Si l'erreur doit être ignorée, il faut désactiver la vérification `duplicate-header` dans le {validator}.

source: Blank Row
fr: Ligne vide

source: Row {row_number} is completely blank
fr: La ligne {row_number} est complètement vide

source: This row is empty. A row should contain at least one value. How it could be resolved: - Delete the row. - If this error should be ignored disable `blank-row` check in {validator}.
fr: La ligne est vide. Un ligne doit contenir au moins une valeur. Solution : - Supprimer la ligne. - Si l'erreur doit être ignorée, il faut désactiver la vérification `duplicate-header` dans le {validator}.

source: Duplicate Row
fr: Ligne en double

source: Row {row_number} is duplicated to row(s) {row_numbers}
fr: La ligne {row_number} est dupliqué dans la ligne ou les lignes {row_number}

source: The exact same data has been seen in another row. How it could be resolved: - If some of the data is incorrect, correct it. - If the whole row is an incorrect duplicate, remove it. - If this error should be ignored disable `duplicate-row` check in {validator}.
fr: La même donnée se trouve dans une autre ligne. Solution : - Corriger la donnée si elle est incorrecte. - Si toute la ligne est un doublon erroné, elle doit être supprimée. - Si l'erreur doit être ignorée, il faut désactiver la vérification `duplicate-row` dans le {validator}.

source: Extra Value
fr: Valeur supplémentaire

source: Row {row_number} has an extra value in column {column_number}
fr: La ligne {row_number} contient une valeur supplémentaire dans la colonne {column_number}

source: This row has more values compared to the header row (the first row in the data source). A key concept is that all the rows in tabular data must have the same number of columns. How it could be resolved: - Check data has an extra comma between the values in this row. - If this error should be ignored disable `extra-value` check in {validator}.
fr: Cette ligne contient plus de valeurs que la ligne de l'en-tête (la première ligne dans lasource des données). Toutes les lignes des données tabulaires doivent avoir le même nombre de colonnes. Solution : - Vérifier si les données ont une virgule supplémentaire entre les valeur dans cette ligne. - Si l'erreur doit être ignorée, il faut désactiver la vérification `extra-value` dans le {validator}.

source: Missing Value
fr: Valeur manquante

source: Row {row_number} has a missing value in column {column_number}
fr: Il manque une valeur dans la ligne {row_number} de la colonne {column_number}

source: This row has less values compared to the header row (the first row in the data source). A key concept is that all the rows in tabular data must have the same number of columns. How it could be resolved: - Check data is not missing a comma between the values in this row. - If this error should be ignored disable `missing-value` check in {validator}.
fr: Cette ligne contient moins de valeurs que la ligne de l'en-tête (la première ligne dans lasource des données). Toutes les lignes des données tabulaires doivent avoirle même nombre de colonnes. Solution : - Vérifier si les données ont une virgule supplémentaire entre les valeur dans cette ligne.- Si l'erreur doit être ignorée, il faut désactiver la vérification `missing-value` dans le {validator}.

source: Table Schema Error
fr: Erreur dans le schéma de données

source: Table Schema error: {error_message}
fr: Erreur dans le schéma de données: {error_message}

source: Provided schema is not valid. How it could be resolved: - Update schema descriptor to be a valid descriptor - If this error should be ignored disable schema checks in {validator}.
fr: Le schéma fournit n'est pas valide. Solution : - Mettre à jour le descripteur du schéma pour qu'il soit valide. - Si l'erreur doit être ignorée, il faut désactiver les vérifications de schéma dans le {validator}.

source: Non-Matching Header
fr: En-tête non concordante

source: Header in column {column_number} doesn't match field name {field_name} in the schema
fr: L'en-tête de la colonne {column_number} ne correspond pas au nom du champ {field_name} dans le schéma

source: One of the data source headers doesn't match the field name defined in the schema. How it could be resolved: - Rename header in the data source or field in the schema - If this error should be ignored disable `non-matching-header` check in {validator}.
fr: L'une des en-têtes de la source de données ne correspond pas au nom du champ défini dans le schéma. Solution : - Renommer l'en-tête dans la source de données ou le champ dans le schéma. - Si l'erreur doit être ignorée, il faut désactiver la vérification `non-matching-header`dans le {validator}.

source: Extra Header
fr: En-tête supplémentaire

source: There is an extra header in column {column_number}
fr: La colonne {column_number} compte une en-tête supplémentaire.

source: The first row of the data source contains header that doesn't exist in the schema. How it could be resolved: - Remove the extra column from the data source or add the missing field to the schema - If this error should be ignored disable `extra-header` check in {validator}.
fr: D'après le schéma, il manquerait une en-tête dans la première ligne dans la source de données. Solution : - Ajouter la colonne manquante dans la source de données ou supprimer le champ supplémentaire dans le schéma - Si l'erreur doit être ignorée, il faut désactiver la vérification `missing-header` dans le {validator}.

source: Missing Header
fr: En-tête manquante

source: There is a missing header in column {column_number}
fr: Il manque une en-tête dans la colonne {column_number}.

source: Type or Format Error
fr: Erreur de type ou de format

source: The value {value} in row {row_number} and column {column_number} is not type {field_type} and format {field_format}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas au type {field_type} et au format {field_format}

source: The value does not match the schema type and format for this field. How it could be resolved: - If this value is not correct, update the value. - If this value is correct, adjust the type and/or format. - To ignore the error, disable the `type-or-format-error` check in {validator}. In this case all schema checks for row values will be ignored.
fr: La valeur ne correspond pas au type et au format du schéma pour ce champ. Solution : - Si la valeur est erronée, il faut la mettre à jour. - Si la valeur est exacte, il faut modifier le type et/ou le format. - Si l'erreur doit être ignorée, il faut désactiver la vérification `type-or-format-error` dans le {validator}. Dans ce cas, toutes les vérifications du schéma pour les valeurs de la ligne seront ignorées.

source: Required Constraint
fr: Contrainte requise

source: Column {column_number} is a required field, but row {row_number} has no value
fr: La colonne {column_number} est un champ obligatoire, mais la ligne {row_number} ne contient aucune valeur.

source: This field is a required field, but it contains no value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove the `required` constraint from the schema. - If this error should be ignored disable `required-constraint` check in {validator}.
fr: Ce champ est obligatoire, mais il ne contient aucune valeur. Solution : - Si la valeur est erronée, il faut la mettre à jour. - Si la valeur est exacte, il faut supprimer la contrainte `required` du schéma. - Si l'erreur doit être ignorée, il faut désactiver la vérification `required-constraint` dans le {validator}.

source: Pattern Constraint
fr: Contrainte de forme

source: The value {value} in row {row_number} and column {column_number} does not conform to the pattern constraint of {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas à la contrainte de forme de {constraint}

source: This field value should conform to constraint pattern. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `pattern` constraint in the schema. - If this error should be ignored disable `pattern-constraint` check in {validator}.
fr: La valeur de ce champ devrait correspondre à la contrainte de forme. Solution : - Si la valeur est erronée, il faut la mettre à jour. - Si la valeur est exacte, il faut supprimer ou affiner la contrainte `pattern` dans le schéma. - Si l'erreur doit être ignorée, il faut désactiver la vérification `pattern-constraint` dans le {validator}.

source: Unique Constraint
fr: Contrainte unique

source: Rows {row_numbers} has unique constraint violation in column {column_number}
fr: Les lignes {row_numbers} présente une violation de contrainte unique dans la colonne {column_number}.

source: This field is a unique field but it contains a value that has been used in another row. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then the values in this column are not unique. Remove the `unique` constraint from the schema. - If this error should be ignored disable `unique-constraint` check in {validator}.
fr: Ce champ est un champ unique, mais il contient une valeur qui a été utilisée dans une autre ligne. Solution : - Si la valeur est erronée, il faut la mettre à jour. - Si la valeur est exacte, alors les valeurs dans cette colonne ne sont pas uniques. Il faut supprimer la contrainte `unique` dans le schéma. - Si l'erreur doit être ignorée, il faut désactiver la vérification `unique-constraint` dans le {validator}.

source: Enumerable Constraint
fr: Contrainte d'énumération

source: The value {value} in row {row_number} and column {column_number} does not conform to the given enumeration: {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas à l'énumération donnée : {constraint}.

source: This field value should be equal to one of the values in the enumeration constraint. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `enum` constraint in the schema. - If this error should be ignored disable `enumerable-constraint` check in {validator}.
fr: La valeur de ce champ devrait correspondre à l'une des valeurs dans la contrainte d'énumération. Solution : - Si la valeur est erronée, il faut la mettre à jour. - Si la valeur est exacte, il faut supprimer ou affiner la contrainte `enum` dans le schéma. - Si l'erreur doit être ignoré, il faut désactiver la vérification `enumerable-constraint` dans le {validator}.

source: Minimum Constraint
fr: Contrainte minimale

source: The value {value} in row {row_number} and column {column_number} does not conform to the minimum constraint of {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas à la contrainte minimale de {constraint}.

source: This field value should be greater or equal than constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `minimum` constraint in the schema. - If this error should be ignored disable `minimum-constraint` check in {validator}.
fr: La valeur de ce champ devrait être supérieure ou égale à la valeur de la contrainte. Solution : - Si la valeur est erronée, il faut la mettre à jour. - Si la valeur est exacte, il faut supprimer ou affiner la contrainte `minimum` dans le schéma. - Si l'erreur doit être ignoré, il faut désactiver la vérification `minimum-constraint` dans le {validator}.

source: Maximum Constraint
fr: Contrainte maximale

source: The value {value} in row {row_number} and column {column_number} does not conform to the maximum constraint of {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas à la contrainte maximale de {constraint}.

source: This field value should be less or equal than constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `maximum` constraint in the schema. - If this error should be ignored disable `maximum-constraint` check in {validator}.
fr: La valeur de ce champ devrait être inférieure ou égale à la valeur de la contrainte. Solution : - Si la valeur est erronée, il faut la mettre à jour. - Si la valeur est exacte, il faut supprimer ou affiner la contrainte `maximum` dans le schéma. - Si l'erreur doit être ignoré, il faut désactiver la vérification `maximum-constraint` dans le {validator}.

source: Minimum Length Constraint
fr: Contrainte du nombre minimal de caractères

source: The value {value} in row {row_number} and column {column_number} does not conform to the minimum length constraint of {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas à la contrainte du nombre minimal de caractères de {constraint}.

source: A length of this field value should be greater or equal than schema constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `minimumLength` constraint in the schema. - If this error should be ignored disable `minimum-length-constraint` check in {validator}.
fr: Le nombre de caractères de la valeur de ce champ devrait être supérieur ou égal à la valeur de la contrainte du schéma. Solution : - Si la valeur est erronée, il faut la mettre à jour. - Si la valeur est exacte, il faut supprimer ou affiner la contrainte `minimumLength` dans le schéma. - Si l'erreur doit être ignoré, il faut désactiver la vérification `minimum-length-constraint` dans le {validator}.

source: Maximum Length Constraint
fr: Contrainte du nombre maximal de caractères

source: The value {value} in row {row_number} and column {column_number} does not conform to the maximum length constraint of {constraint}
fr: La valeur {value} dans la ligne {row_number} et la colonne {column_number} ne correspond pas à la contrainte du nombre maximal de caractères de {constraint}.

source: A length of this field value should be less or equal than schema constraint value. How it could be resolved: - If this value is not correct, update the value. - If value is correct, then remove or refine the `maximumLength` constraint in the schema. - If this error should be ignored disable `maximum-length-constraint` check in {validator}.
fr: Le nombre de caractères de la valeur de ce champ devrait être inférieur ou égal à la valeur de la contrainte du schéma. Solution : - Si la valeur est erronée, il faut la mettre à jour. - Si la valeur est exacte, il faut supprimer ou affiner la contrainte `maximumLength` dans le schéma. - Si l'erreur doit être ignoré, il faut désactiver la vérification `maximum-length-constraint` dans le {validator}.
